lib_app/app/controllers/library_users_controller.rb

SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "library_users" ("library_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["library_id", 1], ["user_id", 2], ["created_at", "2016-01-13 23:23:26.343760"], ["updated_at", "2016-01-13 23:23:26.343760"]]
---
  def create
    @library = Library.find(params[:library_id])
    @library_users.push(current_user)